const radioFileds = [
    {
      name: "isAbroadTrip",
      title: "Вкажіть тип відрядження",
      
      options: [
        { label: "Відрядження по Україні", value:'' },
        { label: "Відрядження за кордон", value: 'true' },
      ],
      type:"radio"
    },
    {
        name:'retentionType',
        title:'Вкажіть вид збереження заробітної плати',
        options:[
            {label:'зі збереженням середньої зарплати за основним місце праці',value:0},
            {label:'зі збереженням середньої зарплати за основним місцем праці та за сумісництвом',value:1},
            {label:'без збереження заробітної плати (тривалість відрядження більше 10-ти днів)',value:2},
        ],
        type:"radio"
    },
  //   {
  //     name:'RetentionType',
  //     title:'Вкажіть вид збереження заробітної плати',
  //     options:[
  //         {label:'зі збереженням середньої зарплати за основним місце праці',value:'зі збереженням середньої зарплати за основним місце праці'},
  //         {label:'зі збереженням середньої зарплати за основним місцем праці та за сумісництвом',value:'зі збереженням середньої зарплати за основним місцем праці та за сумісництвом'},
  //         {label:'без збереження заробітної плати (тривалість відрядження більше 10-ти днів)',value:'без збереження заробітної плати (тривалість відрядження більше 10-ти днів)'},
  //         {label:'another'}
  //     ],
  //     type:"radio"
  // }
  ];
  export default radioFileds;