export const radioFileds = [
    {
      name: "isAbroadTrip",
      title: "Вкажіть тип відрядження",
      
      options: [
        { label: "Відрядження по Україні", value:'' },
        { label: "Відрядження за кордон", value: 'true' },
      ],
      type:"radio"
    },
    {
        name:'retentionType',
        title:'Вкажіть вид збереження заробітної плати',
        options:[
            {label:'зі збереженням середньої зарплати за основним місце праці',value:0},
            {label:'зі збереженням середньої зарплати за основним місцем праці та за сумісництвом',value:1},
            {label:'без збереження заробітної плати (тривалість відрядження більше 10-ти днів)',value:2},
        ],
        type:"radio"
    },
    {
      name:'purpose',
      title:'Вкажіть мету відрядження',
      options:[
          {label:'З метою реалізації права на академічну мобільність відповідно до Постанови Кабінету Міністрів України від 12.08.2019 р. №579',value:'реалізації права на академічну мобільність відповідно до Постанови Кабінету Міністрів України від 12.08.2019 р. №579'},
          {label:'проходження стажування',value:'проходження стажування'},
          {label:'для викладу лекційного курсу',value:'викладу лекційного курсу'},
          {label:'участь в проектній зустрічі',value:'участі в проектній зустрічі'},
          {label:'участь у тренінгу',value:'участі у тренінгу'},

      ],
      type:"radio"
  }
  ];


export const withInputFields=[
 
    {
      name:'purpose',
      title:'Вкажіть мету відрядження',
      options:[
          {label:'З метою реалізації права на академічну мобільність відповідно до Постанови Кабінету Міністрів України від 12.08.2019 р. №579',value:'З метою реалізації права на академічну мобільність відповідно до Постанови Кабінету Міністрів України від 12.08.2019 р. №579'},
          {label:'проходження стажування',value:'проходження стажування'},
          {label:'для викладу лекційного курсу',value:'для викладу лекційного курсу'},
          {label:'участь в проектній зустрічі',value:'участь в проектній зустрічі'},
          {label:'участь у тренінгу',value:'участь у тренінгу'},
          {label:'інше:',value:false}

      ],
      type:"radio"
  }

  
]

